MikroElektronika/core_packages/PIC/XC8/def/PIC12LF1572/mcu.h
// Register: PWM1DC
#define PWM1DC PWM1DC
extern volatile unsigned short          PWM1DC              __at(0xD93);
#ifndef _LIB_BUILD
asm("PWM1DC equ 0D93h");
#endif

// Register: PWM1DCL
#define PWM1DCL PWM1DCL
extern volatile unsigned char           PWM1DCL             __at(0xD93);
#ifndef _LIB_BUILD
asm("PWM1DCL equ 0D93h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM1DCL0               :1;
        unsigned PWM1DCL1               :1;
        unsigned PWM1DCL2               :1;
        unsigned PWM1DCL3               :1;
        unsigned PWM1DCL4               :1;
        unsigned PWM1DCL5               :1;
        unsigned PWM1DCL6               :1;
        unsigned PWM1DCL7               :1;
    };
    struct {
        unsigned PWM1DCL                :8;
    };
} PWM1DCLbits_t;
extern volatile PWM1DCLbits_t PWM1DCLbits __at(0xD93);
// bitfield macros
#define _PWM1DCL_DC_POSN                                    0x0
#define _PWM1DCL_DC_POSITION                                0x0
#define _PWM1DCL_DC_SIZE                                    0x8
#define _PWM1DCL_DC_LENGTH                                  0x8
#define _PWM1DCL_DC_MASK                                    0xFF
#define _PWM1DCL_PWM1DCL0_POSN                              0x0
#define _PWM1DCL_PWM1DCL0_POSITION                          0x0
#define _PWM1DCL_PWM1DCL0_SIZE                              0x1
#define _PWM1DCL_PWM1DCL0_LENGTH                            0x1
#define _PWM1DCL_PWM1DCL0_MASK                              0x1
#define _PWM1DCL_PWM1DCL1_POSN                              0x1
#define _PWM1DCL_PWM1DCL1_POSITION                          0x1
#define _PWM1DCL_PWM1DCL1_SIZE                              0x1
#define _PWM1DCL_PWM1DCL1_LENGTH                            0x1
#define _PWM1DCL_PWM1DCL1_MASK                              0x2
#define _PWM1DCL_PWM1DCL2_POSN                              0x2
#define _PWM1DCL_PWM1DCL2_POSITION                          0x2
#define _PWM1DCL_PWM1DCL2_SIZE                              0x1
#define _PWM1DCL_PWM1DCL2_LENGTH                            0x1
#define _PWM1DCL_PWM1DCL2_MASK                              0x4
#define _PWM1DCL_PWM1DCL3_POSN                              0x3
#define _PWM1DCL_PWM1DCL3_POSITION                          0x3
#define _PWM1DCL_PWM1DCL3_SIZE                              0x1
#define _PWM1DCL_PWM1DCL3_LENGTH                            0x1
#define _PWM1DCL_PWM1DCL3_MASK                              0x8
#define _PWM1DCL_PWM1DCL4_POSN                              0x4
#define _PWM1DCL_PWM1DCL4_POSITION                          0x4
#define _PWM1DCL_PWM1DCL4_SIZE                              0x1
#define _PWM1DCL_PWM1DCL4_LENGTH                            0x1
#define _PWM1DCL_PWM1DCL4_MASK                              0x10
#define _PWM1DCL_PWM1DCL5_POSN                              0x5
#define _PWM1DCL_PWM1DCL5_POSITION                          0x5
#define _PWM1DCL_PWM1DCL5_SIZE                              0x1
#define _PWM1DCL_PWM1DCL5_LENGTH                            0x1
#define _PWM1DCL_PWM1DCL5_MASK                              0x20
#define _PWM1DCL_PWM1DCL6_POSN                              0x6
#define _PWM1DCL_PWM1DCL6_POSITION                          0x6
#define _PWM1DCL_PWM1DCL6_SIZE                              0x1
#define _PWM1DCL_PWM1DCL6_LENGTH                            0x1
#define _PWM1DCL_PWM1DCL6_MASK                              0x40
#define _PWM1DCL_PWM1DCL7_POSN                              0x7
#define _PWM1DCL_PWM1DCL7_POSITION                          0x7
#define _PWM1DCL_PWM1DCL7_SIZE                              0x1
#define _PWM1DCL_PWM1DCL7_LENGTH                            0x1
#define _PWM1DCL_PWM1DCL7_MASK                              0x80
#define _PWM1DCL_PWM1DCL_POSN                               0x0
#define _PWM1DCL_PWM1DCL_POSITION                           0x0
#define _PWM1DCL_PWM1DCL_SIZE                               0x8
#define _PWM1DCL_PWM1DCL_LENGTH                             0x8
#define _PWM1DCL_PWM1DCL_MASK                               0xFF

// Register: PWM1DCH
#define PWM1DCH PWM1DCH
extern volatile unsigned char           PWM1DCH             __at(0xD94);
#ifndef _LIB_BUILD
asm("PWM1DCH equ 0D94h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DC                     :8;
    };
    struct {
        unsigned PWM1DCH0               :1;
        unsigned PWM1DCH1               :1;
        unsigned PWM1DCH2               :1;
        unsigned PWM1DCH3               :1;
        unsigned PWM1DCH4               :1;
        unsigned PWM1DCH5               :1;
        unsigned PWM1DCH6               :1;
        unsigned PWM1DCH7               :1;
    };
    struct {
        unsigned PWM1DCH                :8;
    };
} PWM1DCHbits_t;
extern volatile PWM1DCHbits_t PWM1DCHbits __at(0xD94);
// bitfield macros
#define _PWM1DCH_DC_POSN                                    0x0
#define _PWM1DCH_DC_POSITION                                0x0
#define _PWM1DCH_DC_SIZE                                    0x8
#define _PWM1DCH_DC_LENGTH                                  0x8
#define _PWM1DCH_DC_MASK                                    0xFF
#define _PWM1DCH_PWM1DCH0_POSN                              0x0
#define _PWM1DCH_PWM1DCH0_POSITION                          0x0
#define _PWM1DCH_PWM1DCH0_SIZE                              0x1
#define _PWM1DCH_PWM1DCH0_LENGTH                            0x1
#define _PWM1DCH_PWM1DCH0_MASK                              0x1
#define _PWM1DCH_PWM1DCH1_POSN                              0x1
#define _PWM1DCH_PWM1DCH1_POSITION                          0x1
#define _PWM1DCH_PWM1DCH1_SIZE                              0x1
#define _PWM1DCH_PWM1DCH1_LENGTH                            0x1
#define _PWM1DCH_PWM1DCH1_MASK                              0x2
#define _PWM1DCH_PWM1DCH2_POSN                              0x2
#define _PWM1DCH_PWM1DCH2_POSITION                          0x2
#define _PWM1DCH_PWM1DCH2_SIZE                              0x1
#define _PWM1DCH_PWM1DCH2_LENGTH                            0x1
#define _PWM1DCH_PWM1DCH2_MASK                              0x4
#define _PWM1DCH_PWM1DCH3_POSN                              0x3
#define _PWM1DCH_PWM1DCH3_POSITION                          0x3
#define _PWM1DCH_PWM1DCH3_SIZE                              0x1
#define _PWM1DCH_PWM1DCH3_LENGTH                            0x1
#define _PWM1DCH_PWM1DCH3_MASK                              0x8
#define _PWM1DCH_PWM1DCH4_POSN                              0x4
#define _PWM1DCH_PWM1DCH4_POSITION                          0x4
#define _PWM1DCH_PWM1DCH4_SIZE                              0x1
#define _PWM1DCH_PWM1DCH4_LENGTH                            0x1
#define _PWM1DCH_PWM1DCH4_MASK                              0x10
#define _PWM1DCH_PWM1DCH5_POSN                              0x5
#define _PWM1DCH_PWM1DCH5_POSITION                          0x5
#define _PWM1DCH_PWM1DCH5_SIZE                              0x1
#define _PWM1DCH_PWM1DCH5_LENGTH                            0x1
#define _PWM1DCH_PWM1DCH5_MASK                              0x20
#define _PWM1DCH_PWM1DCH6_POSN                              0x6
#define _PWM1DCH_PWM1DCH6_POSITION                          0x6
#define _PWM1DCH_PWM1DCH6_SIZE                              0x1
#define _PWM1DCH_PWM1DCH6_LENGTH                            0x1
#define _PWM1DCH_PWM1DCH6_MASK                              0x40
#define _PWM1DCH_PWM1DCH7_POSN                              0x7
#define _PWM1DCH_PWM1DCH7_POSITION                          0x7
#define _PWM1DCH_PWM1DCH7_SIZE                              0x1
#define _PWM1DCH_PWM1DCH7_LENGTH                            0x1
#define _PWM1DCH_PWM1DCH7_MASK                              0x80
#define _PWM1DCH_PWM1DCH_POSN                               0x0
#define _PWM1DCH_PWM1DCH_POSITION                           0x0
#define _PWM1DCH_PWM1DCH_SIZE                               0x8
#define _PWM1DCH_PWM1DCH_LENGTH                             0x8
#define _PWM1DCH_PWM1DCH_MASK                               0xFF

// Register: PWM1PR
#define PWM1PR PWM1PR
extern volatile unsigned short          PWM1PR              __at(0xD95);
#ifndef _LIB_BUILD
asm("PWM1PR equ 0D95h");
#endif

// Register: PWM1PRL
#define PWM1PRL PWM1PRL
extern volatile unsigned char           PWM1PRL             __at(0xD95);
#ifndef _LIB_BUILD
asm("PWM1PRL equ 0D95h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM1PRL0               :1;
        unsigned PWM1PRL1               :1;
        unsigned PWM1PRL2               :1;
        unsigned PWM1PRL3               :1;
        unsigned PWM1PRL4               :1;
        unsigned PWM1PRL5               :1;
        unsigned PWM1PRL6               :1;
        unsigned PWM1PRL7               :1;
    };
    struct {
        unsigned PWM1PRL                :8;
    };
} PWM1PRLbits_t;
extern volatile PWM1PRLbits_t PWM1PRLbits __at(0xD95);
// bitfield macros
#define _PWM1PRL_PR_POSN                                    0x0
#define _PWM1PRL_PR_POSITION                                0x0
#define _PWM1PRL_PR_SIZE                                    0x8
#define _PWM1PRL_PR_LENGTH                                  0x8
#define _PWM1PRL_PR_MASK                                    0xFF
#define _PWM1PRL_PWM1PRL0_POSN                              0x0
#define _PWM1PRL_PWM1PRL0_POSITION                          0x0
#define _PWM1PRL_PWM1PRL0_SIZE                              0x1
#define _PWM1PRL_PWM1PRL0_LENGTH                            0x1
#define _PWM1PRL_PWM1PRL0_MASK                              0x1
#define _PWM1PRL_PWM1PRL1_POSN                              0x1
#define _PWM1PRL_PWM1PRL1_POSITION                          0x1
#define _PWM1PRL_PWM1PRL1_SIZE                              0x1
#define _PWM1PRL_PWM1PRL1_LENGTH                            0x1
#define _PWM1PRL_PWM1PRL1_MASK                              0x2
#define _PWM1PRL_PWM1PRL2_POSN                              0x2
#define _PWM1PRL_PWM1PRL2_POSITION                          0x2
#define _PWM1PRL_PWM1PRL2_SIZE                              0x1
#define _PWM1PRL_PWM1PRL2_LENGTH                            0x1
#define _PWM1PRL_PWM1PRL2_MASK                              0x4
#define _PWM1PRL_PWM1PRL3_POSN                              0x3
#define _PWM1PRL_PWM1PRL3_POSITION                          0x3
#define _PWM1PRL_PWM1PRL3_SIZE                              0x1
#define _PWM1PRL_PWM1PRL3_LENGTH                            0x1
#define _PWM1PRL_PWM1PRL3_MASK                              0x8
#define _PWM1PRL_PWM1PRL4_POSN                              0x4
#define _PWM1PRL_PWM1PRL4_POSITION                          0x4
#define _PWM1PRL_PWM1PRL4_SIZE                              0x1
#define _PWM1PRL_PWM1PRL4_LENGTH                            0x1
#define _PWM1PRL_PWM1PRL4_MASK                              0x10
#define _PWM1PRL_PWM1PRL5_POSN                              0x5
#define _PWM1PRL_PWM1PRL5_POSITION                          0x5
#define _PWM1PRL_PWM1PRL5_SIZE                              0x1
#define _PWM1PRL_PWM1PRL5_LENGTH                            0x1
#define _PWM1PRL_PWM1PRL5_MASK                              0x20
#define _PWM1PRL_PWM1PRL6_POSN                              0x6
#define _PWM1PRL_PWM1PRL6_POSITION                          0x6
#define _PWM1PRL_PWM1PRL6_SIZE                              0x1
#define _PWM1PRL_PWM1PRL6_LENGTH                            0x1
#define _PWM1PRL_PWM1PRL6_MASK                              0x40
#define _PWM1PRL_PWM1PRL7_POSN                              0x7
#define _PWM1PRL_PWM1PRL7_POSITION                          0x7
#define _PWM1PRL_PWM1PRL7_SIZE                              0x1
#define _PWM1PRL_PWM1PRL7_LENGTH                            0x1
#define _PWM1PRL_PWM1PRL7_MASK                              0x80
#define _PWM1PRL_PWM1PRL_POSN                               0x0
#define _PWM1PRL_PWM1PRL_POSITION                           0x0
#define _PWM1PRL_PWM1PRL_SIZE                               0x8
#define _PWM1PRL_PWM1PRL_LENGTH                             0x8
#define _PWM1PRL_PWM1PRL_MASK                               0xFF

// Register: PWM1PRH
#define PWM1PRH PWM1PRH
extern volatile unsigned char           PWM1PRH             __at(0xD96);
#ifndef _LIB_BUILD
asm("PWM1PRH equ 0D96h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR                     :8;
    };
    struct {
        unsigned PWM1PRH0               :1;
        unsigned PWM1PRH1               :1;
        unsigned PWM1PRH2               :1;
        unsigned PWM1PRH3               :1;
        unsigned PWM1PRH4               :1;
        unsigned PWM1PRH5               :1;
        unsigned PWM1PRH6               :1;
        unsigned PWM1PRH7               :1;
    };
    struct {
        unsigned PWM1PRH                :8;
    };
} PWM1PRHbits_t;
extern volatile PWM1PRHbits_t PWM1PRHbits __at(0xD96);
// bitfield macros
#define _PWM1PRH_PR_POSN                                    0x0
#define _PWM1PRH_PR_POSITION                                0x0
#define _PWM1PRH_PR_SIZE                                    0x8
#define _PWM1PRH_PR_LENGTH                                  0x8
#define _PWM1PRH_PR_MASK                                    0xFF
#define _PWM1PRH_PWM1PRH0_POSN                              0x0
#define _PWM1PRH_PWM1PRH0_POSITION                          0x0
#define _PWM1PRH_PWM1PRH0_SIZE                              0x1
#define _PWM1PRH_PWM1PRH0_LENGTH                            0x1
#define _PWM1PRH_PWM1PRH0_MASK                              0x1
#define _PWM1PRH_PWM1PRH1_POSN                              0x1
#define _PWM1PRH_PWM1PRH1_POSITION                          0x1
#define _PWM1PRH_PWM1PRH1_SIZE                              0x1
#define _PWM1PRH_PWM1PRH1_LENGTH                            0x1
#define _PWM1PRH_PWM1PRH1_MASK                              0x2
#define _PWM1PRH_PWM1PRH2_POSN                              0x2
#define _PWM1PRH_PWM1PRH2_POSITION                          0x2
#define _PWM1PRH_PWM1PRH2_SIZE                              0x1
#define _PWM1PRH_PWM1PRH2_LENGTH                            0x1
#define _PWM1PRH_PWM1PRH2_MASK                              0x4
#define _PWM1PRH_PWM1PRH3_POSN                              0x3
#define _PWM1PRH_PWM1PRH3_POSITION                          0x3
#define _PWM1PRH_PWM1PRH3_SIZE                              0x1
#define _PWM1PRH_PWM1PRH3_LENGTH                            0x1
#define _PWM1PRH_PWM1PRH3_MASK                              0x8
#define _PWM1PRH_PWM1PRH4_POSN                              0x4
#define _PWM1PRH_PWM1PRH4_POSITION                          0x4
#define _PWM1PRH_PWM1PRH4_SIZE                              0x1
#define _PWM1PRH_PWM1PRH4_LENGTH                            0x1
#define _PWM1PRH_PWM1PRH4_MASK                              0x10
#define _PWM1PRH_PWM1PRH5_POSN                              0x5
#define _PWM1PRH_PWM1PRH5_POSITION                          0x5
#define _PWM1PRH_PWM1PRH5_SIZE                              0x1
#define _PWM1PRH_PWM1PRH5_LENGTH                            0x1
#define _PWM1PRH_PWM1PRH5_MASK                              0x20
#define _PWM1PRH_PWM1PRH6_POSN                              0x6
#define _PWM1PRH_PWM1PRH6_POSITION                          0x6
#define _PWM1PRH_PWM1PRH6_SIZE                              0x1
#define _PWM1PRH_PWM1PRH6_LENGTH                            0x1
#define _PWM1PRH_PWM1PRH6_MASK                              0x40
#define _PWM1PRH_PWM1PRH7_POSN                              0x7
#define _PWM1PRH_PWM1PRH7_POSITION                          0x7
#define _PWM1PRH_PWM1PRH7_SIZE                              0x1
#define _PWM1PRH_PWM1PRH7_LENGTH                            0x1
#define _PWM1PRH_PWM1PRH7_MASK                              0x80
#define _PWM1PRH_PWM1PRH_POSN                               0x0
#define _PWM1PRH_PWM1PRH_POSITION                           0x0
#define _PWM1PRH_PWM1PRH_SIZE                               0x8
#define _PWM1PRH_PWM1PRH_LENGTH                             0x8
#define _PWM1PRH_PWM1PRH_MASK                               0xFF

