MikroElektronika/core_packages/PIC/XC8/def/PIC12LF1572/mcu.h
// Register: PWM2CON
#define PWM2CON PWM2CON
extern volatile unsigned char           PWM2CON             __at(0xDAB);
#ifndef _LIB_BUILD
asm("PWM2CON equ 0DABh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned MODE                   :2;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned OE                     :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM2MODE0              :1;
        unsigned PWM2MODE1              :1;
    };
    struct {
        unsigned                        :2;
        unsigned PWM2MODE               :2;
        unsigned PWM2POL                :1;
        unsigned PWM2OUT                :1;
        unsigned PWM2OE                 :1;
        unsigned PWM2EN                 :1;
    };
    struct {
        unsigned                        :2;
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
    };
} PWM2CONbits_t;
extern volatile PWM2CONbits_t PWM2CONbits __at(0xDAB);
// bitfield macros
#define _PWM2CON_MODE_POSN                                  0x2
#define _PWM2CON_MODE_POSITION                              0x2
#define _PWM2CON_MODE_SIZE                                  0x2
#define _PWM2CON_MODE_LENGTH                                0x2
#define _PWM2CON_MODE_MASK                                  0xC
#define _PWM2CON_POL_POSN                                   0x4
#define _PWM2CON_POL_POSITION                               0x4
#define _PWM2CON_POL_SIZE                                   0x1
#define _PWM2CON_POL_LENGTH                                 0x1
#define _PWM2CON_POL_MASK                                   0x10
#define _PWM2CON_OUT_POSN                                   0x5
#define _PWM2CON_OUT_POSITION                               0x5
#define _PWM2CON_OUT_SIZE                                   0x1
#define _PWM2CON_OUT_LENGTH                                 0x1
#define _PWM2CON_OUT_MASK                                   0x20
#define _PWM2CON_OE_POSN                                    0x6
#define _PWM2CON_OE_POSITION                                0x6
#define _PWM2CON_OE_SIZE                                    0x1
#define _PWM2CON_OE_LENGTH                                  0x1
#define _PWM2CON_OE_MASK                                    0x40
#define _PWM2CON_EN_POSN                                    0x7
#define _PWM2CON_EN_POSITION                                0x7
#define _PWM2CON_EN_SIZE                                    0x1
#define _PWM2CON_EN_LENGTH                                  0x1
#define _PWM2CON_EN_MASK                                    0x80
#define _PWM2CON_PWM2MODE0_POSN                             0x2
#define _PWM2CON_PWM2MODE0_POSITION                         0x2
#define _PWM2CON_PWM2MODE0_SIZE                             0x1
#define _PWM2CON_PWM2MODE0_LENGTH                           0x1
#define _PWM2CON_PWM2MODE0_MASK                             0x4
#define _PWM2CON_PWM2MODE1_POSN                             0x3
#define _PWM2CON_PWM2MODE1_POSITION                         0x3
#define _PWM2CON_PWM2MODE1_SIZE                             0x1
#define _PWM2CON_PWM2MODE1_LENGTH                           0x1
#define _PWM2CON_PWM2MODE1_MASK                             0x8
#define _PWM2CON_PWM2MODE_POSN                              0x2
#define _PWM2CON_PWM2MODE_POSITION                          0x2
#define _PWM2CON_PWM2MODE_SIZE                              0x2
#define _PWM2CON_PWM2MODE_LENGTH                            0x2
#define _PWM2CON_PWM2MODE_MASK                              0xC
#define _PWM2CON_PWM2POL_POSN                               0x4
#define _PWM2CON_PWM2POL_POSITION                           0x4
#define _PWM2CON_PWM2POL_SIZE                               0x1
#define _PWM2CON_PWM2POL_LENGTH                             0x1
#define _PWM2CON_PWM2POL_MASK                               0x10
#define _PWM2CON_PWM2OUT_POSN                               0x5
#define _PWM2CON_PWM2OUT_POSITION                           0x5
#define _PWM2CON_PWM2OUT_SIZE                               0x1
#define _PWM2CON_PWM2OUT_LENGTH                             0x1
#define _PWM2CON_PWM2OUT_MASK                               0x20
#define _PWM2CON_PWM2OE_POSN                                0x6
#define _PWM2CON_PWM2OE_POSITION                            0x6
#define _PWM2CON_PWM2OE_SIZE                                0x1
#define _PWM2CON_PWM2OE_LENGTH                              0x1
#define _PWM2CON_PWM2OE_MASK                                0x40
#define _PWM2CON_PWM2EN_POSN                                0x7
#define _PWM2CON_PWM2EN_POSITION                            0x7
#define _PWM2CON_PWM2EN_SIZE                                0x1
#define _PWM2CON_PWM2EN_LENGTH                              0x1
#define _PWM2CON_PWM2EN_MASK                                0x80
#define _PWM2CON_MODE0_POSN                                 0x2
#define _PWM2CON_MODE0_POSITION                             0x2
#define _PWM2CON_MODE0_SIZE                                 0x1
#define _PWM2CON_MODE0_LENGTH                               0x1
#define _PWM2CON_MODE0_MASK                                 0x4
#define _PWM2CON_MODE1_POSN                                 0x3
#define _PWM2CON_MODE1_POSITION                             0x3
#define _PWM2CON_MODE1_SIZE                                 0x1
#define _PWM2CON_MODE1_LENGTH                               0x1
#define _PWM2CON_MODE1_MASK                                 0x8

// Register: PWM2INTE
#define PWM2INTE PWM2INTE
extern volatile unsigned char           PWM2INTE            __at(0xDAC);
#ifndef _LIB_BUILD
asm("PWM2INTE equ 0DACh");
#endif
// aliases
extern volatile unsigned char           PWM2INTCON          __at(0xDAC);
#ifndef _LIB_BUILD
asm("PWM2INTCON equ 0DACh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM2PRIE               :1;
        unsigned PWM2DCIE               :1;
        unsigned PWM2PHIE               :1;
        unsigned PWM2OFIE               :1;
    };
} PWM2INTEbits_t;
extern volatile PWM2INTEbits_t PWM2INTEbits __at(0xDAC);
// bitfield macros
#define _PWM2INTE_PRIE_POSN                                 0x0
#define _PWM2INTE_PRIE_POSITION                             0x0
#define _PWM2INTE_PRIE_SIZE                                 0x1
#define _PWM2INTE_PRIE_LENGTH                               0x1
#define _PWM2INTE_PRIE_MASK                                 0x1
#define _PWM2INTE_DCIE_POSN                                 0x1
#define _PWM2INTE_DCIE_POSITION                             0x1
#define _PWM2INTE_DCIE_SIZE                                 0x1
#define _PWM2INTE_DCIE_LENGTH                               0x1
#define _PWM2INTE_DCIE_MASK                                 0x2
#define _PWM2INTE_PHIE_POSN                                 0x2
#define _PWM2INTE_PHIE_POSITION                             0x2
#define _PWM2INTE_PHIE_SIZE                                 0x1
#define _PWM2INTE_PHIE_LENGTH                               0x1
#define _PWM2INTE_PHIE_MASK                                 0x4
#define _PWM2INTE_OFIE_POSN                                 0x3
#define _PWM2INTE_OFIE_POSITION                             0x3
#define _PWM2INTE_OFIE_SIZE                                 0x1
#define _PWM2INTE_OFIE_LENGTH                               0x1
#define _PWM2INTE_OFIE_MASK                                 0x8
#define _PWM2INTE_PWM2PRIE_POSN                             0x0
#define _PWM2INTE_PWM2PRIE_POSITION                         0x0
#define _PWM2INTE_PWM2PRIE_SIZE                             0x1
#define _PWM2INTE_PWM2PRIE_LENGTH                           0x1
#define _PWM2INTE_PWM2PRIE_MASK                             0x1
#define _PWM2INTE_PWM2DCIE_POSN                             0x1
#define _PWM2INTE_PWM2DCIE_POSITION                         0x1
#define _PWM2INTE_PWM2DCIE_SIZE                             0x1
#define _PWM2INTE_PWM2DCIE_LENGTH                           0x1
#define _PWM2INTE_PWM2DCIE_MASK                             0x2
#define _PWM2INTE_PWM2PHIE_POSN                             0x2
#define _PWM2INTE_PWM2PHIE_POSITION                         0x2
#define _PWM2INTE_PWM2PHIE_SIZE                             0x1
#define _PWM2INTE_PWM2PHIE_LENGTH                           0x1
#define _PWM2INTE_PWM2PHIE_MASK                             0x4
#define _PWM2INTE_PWM2OFIE_POSN                             0x3
#define _PWM2INTE_PWM2OFIE_POSITION                         0x3
#define _PWM2INTE_PWM2OFIE_SIZE                             0x1
#define _PWM2INTE_PWM2OFIE_LENGTH                           0x1
#define _PWM2INTE_PWM2OFIE_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIE                   :1;
        unsigned DCIE                   :1;
        unsigned PHIE                   :1;
        unsigned OFIE                   :1;
    };
    struct {
        unsigned PWM2PRIE               :1;
        unsigned PWM2DCIE               :1;
        unsigned PWM2PHIE               :1;
        unsigned PWM2OFIE               :1;
    };
} PWM2INTCONbits_t;
extern volatile PWM2INTCONbits_t PWM2INTCONbits __at(0xDAC);
// bitfield macros
#define _PWM2INTCON_PRIE_POSN                               0x0
#define _PWM2INTCON_PRIE_POSITION                           0x0
#define _PWM2INTCON_PRIE_SIZE                               0x1
#define _PWM2INTCON_PRIE_LENGTH                             0x1
#define _PWM2INTCON_PRIE_MASK                               0x1
#define _PWM2INTCON_DCIE_POSN                               0x1
#define _PWM2INTCON_DCIE_POSITION                           0x1
#define _PWM2INTCON_DCIE_SIZE                               0x1
#define _PWM2INTCON_DCIE_LENGTH                             0x1
#define _PWM2INTCON_DCIE_MASK                               0x2
#define _PWM2INTCON_PHIE_POSN                               0x2
#define _PWM2INTCON_PHIE_POSITION                           0x2
#define _PWM2INTCON_PHIE_SIZE                               0x1
#define _PWM2INTCON_PHIE_LENGTH                             0x1
#define _PWM2INTCON_PHIE_MASK                               0x4
#define _PWM2INTCON_OFIE_POSN                               0x3
#define _PWM2INTCON_OFIE_POSITION                           0x3
#define _PWM2INTCON_OFIE_SIZE                               0x1
#define _PWM2INTCON_OFIE_LENGTH                             0x1
#define _PWM2INTCON_OFIE_MASK                               0x8
#define _PWM2INTCON_PWM2PRIE_POSN                           0x0
#define _PWM2INTCON_PWM2PRIE_POSITION                       0x0
#define _PWM2INTCON_PWM2PRIE_SIZE                           0x1
#define _PWM2INTCON_PWM2PRIE_LENGTH                         0x1
#define _PWM2INTCON_PWM2PRIE_MASK                           0x1
#define _PWM2INTCON_PWM2DCIE_POSN                           0x1
#define _PWM2INTCON_PWM2DCIE_POSITION                       0x1
#define _PWM2INTCON_PWM2DCIE_SIZE                           0x1
#define _PWM2INTCON_PWM2DCIE_LENGTH                         0x1
#define _PWM2INTCON_PWM2DCIE_MASK                           0x2
#define _PWM2INTCON_PWM2PHIE_POSN                           0x2
#define _PWM2INTCON_PWM2PHIE_POSITION                       0x2
#define _PWM2INTCON_PWM2PHIE_SIZE                           0x1
#define _PWM2INTCON_PWM2PHIE_LENGTH                         0x1
#define _PWM2INTCON_PWM2PHIE_MASK                           0x4
#define _PWM2INTCON_PWM2OFIE_POSN                           0x3
#define _PWM2INTCON_PWM2OFIE_POSITION                       0x3
#define _PWM2INTCON_PWM2OFIE_SIZE                           0x1
#define _PWM2INTCON_PWM2OFIE_LENGTH                         0x1
#define _PWM2INTCON_PWM2OFIE_MASK                           0x8

// Register: PWM2INTF
#define PWM2INTF PWM2INTF
extern volatile unsigned char           PWM2INTF            __at(0xDAD);
#ifndef _LIB_BUILD
asm("PWM2INTF equ 0DADh");
#endif
// aliases
extern volatile unsigned char           PWM2INTFLG          __at(0xDAD);
#ifndef _LIB_BUILD
asm("PWM2INTFLG equ 0DADh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM2PRIF               :1;
        unsigned PWM2DCIF               :1;
        unsigned PWM2PHIF               :1;
        unsigned PWM2OFIF               :1;
    };
} PWM2INTFbits_t;
extern volatile PWM2INTFbits_t PWM2INTFbits __at(0xDAD);
// bitfield macros
#define _PWM2INTF_PRIF_POSN                                 0x0
#define _PWM2INTF_PRIF_POSITION                             0x0
#define _PWM2INTF_PRIF_SIZE                                 0x1
#define _PWM2INTF_PRIF_LENGTH                               0x1
#define _PWM2INTF_PRIF_MASK                                 0x1
#define _PWM2INTF_DCIF_POSN                                 0x1
#define _PWM2INTF_DCIF_POSITION                             0x1
#define _PWM2INTF_DCIF_SIZE                                 0x1
#define _PWM2INTF_DCIF_LENGTH                               0x1
#define _PWM2INTF_DCIF_MASK                                 0x2
#define _PWM2INTF_PHIF_POSN                                 0x2
#define _PWM2INTF_PHIF_POSITION                             0x2
#define _PWM2INTF_PHIF_SIZE                                 0x1
#define _PWM2INTF_PHIF_LENGTH                               0x1
#define _PWM2INTF_PHIF_MASK                                 0x4
#define _PWM2INTF_OFIF_POSN                                 0x3
#define _PWM2INTF_OFIF_POSITION                             0x3
#define _PWM2INTF_OFIF_SIZE                                 0x1
#define _PWM2INTF_OFIF_LENGTH                               0x1
#define _PWM2INTF_OFIF_MASK                                 0x8
#define _PWM2INTF_PWM2PRIF_POSN                             0x0
#define _PWM2INTF_PWM2PRIF_POSITION                         0x0
#define _PWM2INTF_PWM2PRIF_SIZE                             0x1
#define _PWM2INTF_PWM2PRIF_LENGTH                           0x1
#define _PWM2INTF_PWM2PRIF_MASK                             0x1
#define _PWM2INTF_PWM2DCIF_POSN                             0x1
#define _PWM2INTF_PWM2DCIF_POSITION                         0x1
#define _PWM2INTF_PWM2DCIF_SIZE                             0x1
#define _PWM2INTF_PWM2DCIF_LENGTH                           0x1
#define _PWM2INTF_PWM2DCIF_MASK                             0x2
#define _PWM2INTF_PWM2PHIF_POSN                             0x2
#define _PWM2INTF_PWM2PHIF_POSITION                         0x2
#define _PWM2INTF_PWM2PHIF_SIZE                             0x1
#define _PWM2INTF_PWM2PHIF_LENGTH                           0x1
#define _PWM2INTF_PWM2PHIF_MASK                             0x4
#define _PWM2INTF_PWM2OFIF_POSN                             0x3
#define _PWM2INTF_PWM2OFIF_POSITION                         0x3
#define _PWM2INTF_PWM2OFIF_SIZE                             0x1
#define _PWM2INTF_PWM2OFIF_LENGTH                           0x1
#define _PWM2INTF_PWM2OFIF_MASK                             0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned PRIF                   :1;
        unsigned DCIF                   :1;
        unsigned PHIF                   :1;
        unsigned OFIF                   :1;
    };
    struct {
        unsigned PWM2PRIF               :1;
        unsigned PWM2DCIF               :1;
        unsigned PWM2PHIF               :1;
        unsigned PWM2OFIF               :1;
    };
} PWM2INTFLGbits_t;
extern volatile PWM2INTFLGbits_t PWM2INTFLGbits __at(0xDAD);
// bitfield macros
#define _PWM2INTFLG_PRIF_POSN                               0x0
#define _PWM2INTFLG_PRIF_POSITION                           0x0
#define _PWM2INTFLG_PRIF_SIZE                               0x1
#define _PWM2INTFLG_PRIF_LENGTH                             0x1
#define _PWM2INTFLG_PRIF_MASK                               0x1
#define _PWM2INTFLG_DCIF_POSN                               0x1
#define _PWM2INTFLG_DCIF_POSITION                           0x1
#define _PWM2INTFLG_DCIF_SIZE                               0x1
#define _PWM2INTFLG_DCIF_LENGTH                             0x1
#define _PWM2INTFLG_DCIF_MASK                               0x2
#define _PWM2INTFLG_PHIF_POSN                               0x2
#define _PWM2INTFLG_PHIF_POSITION                           0x2
#define _PWM2INTFLG_PHIF_SIZE                               0x1
#define _PWM2INTFLG_PHIF_LENGTH                             0x1
#define _PWM2INTFLG_PHIF_MASK                               0x4
#define _PWM2INTFLG_OFIF_POSN                               0x3
#define _PWM2INTFLG_OFIF_POSITION                           0x3
#define _PWM2INTFLG_OFIF_SIZE                               0x1
#define _PWM2INTFLG_OFIF_LENGTH                             0x1
#define _PWM2INTFLG_OFIF_MASK                               0x8
#define _PWM2INTFLG_PWM2PRIF_POSN                           0x0
#define _PWM2INTFLG_PWM2PRIF_POSITION                       0x0
#define _PWM2INTFLG_PWM2PRIF_SIZE                           0x1
#define _PWM2INTFLG_PWM2PRIF_LENGTH                         0x1
#define _PWM2INTFLG_PWM2PRIF_MASK                           0x1
#define _PWM2INTFLG_PWM2DCIF_POSN                           0x1
#define _PWM2INTFLG_PWM2DCIF_POSITION                       0x1
#define _PWM2INTFLG_PWM2DCIF_SIZE                           0x1
#define _PWM2INTFLG_PWM2DCIF_LENGTH                         0x1
#define _PWM2INTFLG_PWM2DCIF_MASK                           0x2
#define _PWM2INTFLG_PWM2PHIF_POSN                           0x2
#define _PWM2INTFLG_PWM2PHIF_POSITION                       0x2
#define _PWM2INTFLG_PWM2PHIF_SIZE                           0x1
#define _PWM2INTFLG_PWM2PHIF_LENGTH                         0x1
#define _PWM2INTFLG_PWM2PHIF_MASK                           0x4
#define _PWM2INTFLG_PWM2OFIF_POSN                           0x3
#define _PWM2INTFLG_PWM2OFIF_POSITION                       0x3
#define _PWM2INTFLG_PWM2OFIF_SIZE                           0x1
#define _PWM2INTFLG_PWM2OFIF_LENGTH                         0x1
#define _PWM2INTFLG_PWM2OFIF_MASK                           0x8

// Register: PWM2CLKCON
#define PWM2CLKCON PWM2CLKCON
extern volatile unsigned char           PWM2CLKCON          __at(0xDAE);
#ifndef _LIB_BUILD
asm("PWM2CLKCON equ 0DAEh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :2;
        unsigned                        :2;
        unsigned PS                     :3;
    };
    struct {
        unsigned PWM2CS0                :1;
        unsigned PWM2CS1                :1;
        unsigned                        :2;
        unsigned PWM2PS0                :1;
        unsigned PWM2PS1                :1;
        unsigned PWM2PS2                :1;
    };
    struct {
        unsigned PWM2CS                 :3;
        unsigned                        :1;
        unsigned PWM2PS                 :3;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned                        :2;
        unsigned _PS0                    :1;  // Note: Changed by MikroE
        unsigned _PS1                    :1;  // Note: Changed by MikroE
        unsigned _PS2                    :1;  // Note: Changed by MikroE
    };
} PWM2CLKCONbits_t;
