MikroElektronika/core_packages/PIC/XC8/def/PIC12LF1572/mcu.h
// PWM1PHL<PWM1PHL5>
extern volatile __bit                   PWM1PHL5            __at(0x6C8D);	// @ (0xD91 * 8 + 5)
#define                                 PWM1PHL5_bit        _BIT_ACCESS(PWM1PHL,5)
// PWM1PHL<PWM1PHL6>
extern volatile __bit                   PWM1PHL6            __at(0x6C8E);	// @ (0xD91 * 8 + 6)
#define                                 PWM1PHL6_bit        _BIT_ACCESS(PWM1PHL,6)
// PWM1PHL<PWM1PHL7>
extern volatile __bit                   PWM1PHL7            __at(0x6C8F);	// @ (0xD91 * 8 + 7)
#define                                 PWM1PHL7_bit        _BIT_ACCESS(PWM1PHL,7)
// PWM1CON<PWM1POL>
extern volatile __bit                   PWM1POL             __at(0x6CDC);	// @ (0xD9B * 8 + 4)
#define                                 PWM1POL_bit         _BIT_ACCESS(PWM1CON,4)
// PWM1PRH<PWM1PRH0>
extern volatile __bit                   PWM1PRH0            __at(0x6CB0);	// @ (0xD96 * 8 + 0)
#define                                 PWM1PRH0_bit        _BIT_ACCESS(PWM1PRH,0)
// PWM1PRH<PWM1PRH1>
extern volatile __bit                   PWM1PRH1            __at(0x6CB1);	// @ (0xD96 * 8 + 1)
#define                                 PWM1PRH1_bit        _BIT_ACCESS(PWM1PRH,1)
// PWM1PRH<PWM1PRH2>
extern volatile __bit                   PWM1PRH2            __at(0x6CB2);	// @ (0xD96 * 8 + 2)
#define                                 PWM1PRH2_bit        _BIT_ACCESS(PWM1PRH,2)
// PWM1PRH<PWM1PRH3>
extern volatile __bit                   PWM1PRH3            __at(0x6CB3);	// @ (0xD96 * 8 + 3)
#define                                 PWM1PRH3_bit        _BIT_ACCESS(PWM1PRH,3)
// PWM1PRH<PWM1PRH4>
extern volatile __bit                   PWM1PRH4            __at(0x6CB4);	// @ (0xD96 * 8 + 4)
#define                                 PWM1PRH4_bit        _BIT_ACCESS(PWM1PRH,4)
// PWM1PRH<PWM1PRH5>
extern volatile __bit                   PWM1PRH5            __at(0x6CB5);	// @ (0xD96 * 8 + 5)
#define                                 PWM1PRH5_bit        _BIT_ACCESS(PWM1PRH,5)
// PWM1PRH<PWM1PRH6>
extern volatile __bit                   PWM1PRH6            __at(0x6CB6);	// @ (0xD96 * 8 + 6)
#define                                 PWM1PRH6_bit        _BIT_ACCESS(PWM1PRH,6)
// PWM1PRH<PWM1PRH7>
extern volatile __bit                   PWM1PRH7            __at(0x6CB7);	// @ (0xD96 * 8 + 7)
#define                                 PWM1PRH7_bit        _BIT_ACCESS(PWM1PRH,7)
// PWM1INTE<PWM1PRIE>
extern volatile __bit                   PWM1PRIE            __at(0x6CE0);	// @ (0xD9C * 8 + 0)
#define                                 PWM1PRIE_bit        _BIT_ACCESS(PWM1INTE,0)
// PWM1INTF<PWM1PRIF>
extern volatile __bit                   PWM1PRIF            __at(0x6CE8);	// @ (0xD9D * 8 + 0)
#define                                 PWM1PRIF_bit        _BIT_ACCESS(PWM1INTF,0)
// PWM1PRL<PWM1PRL0>
extern volatile __bit                   PWM1PRL0            __at(0x6CA8);	// @ (0xD95 * 8 + 0)
#define                                 PWM1PRL0_bit        _BIT_ACCESS(PWM1PRL,0)
// PWM1PRL<PWM1PRL1>
extern volatile __bit                   PWM1PRL1            __at(0x6CA9);	// @ (0xD95 * 8 + 1)
#define                                 PWM1PRL1_bit        _BIT_ACCESS(PWM1PRL,1)
// PWM1PRL<PWM1PRL2>
extern volatile __bit                   PWM1PRL2            __at(0x6CAA);	// @ (0xD95 * 8 + 2)
#define                                 PWM1PRL2_bit        _BIT_ACCESS(PWM1PRL,2)
// PWM1PRL<PWM1PRL3>
extern volatile __bit                   PWM1PRL3            __at(0x6CAB);	// @ (0xD95 * 8 + 3)
#define                                 PWM1PRL3_bit        _BIT_ACCESS(PWM1PRL,3)
// PWM1PRL<PWM1PRL4>
extern volatile __bit                   PWM1PRL4            __at(0x6CAC);	// @ (0xD95 * 8 + 4)
#define                                 PWM1PRL4_bit        _BIT_ACCESS(PWM1PRL,4)
// PWM1PRL<PWM1PRL5>
extern volatile __bit                   PWM1PRL5            __at(0x6CAD);	// @ (0xD95 * 8 + 5)
#define                                 PWM1PRL5_bit        _BIT_ACCESS(PWM1PRL,5)
// PWM1PRL<PWM1PRL6>
extern volatile __bit                   PWM1PRL6            __at(0x6CAE);	// @ (0xD95 * 8 + 6)
#define                                 PWM1PRL6_bit        _BIT_ACCESS(PWM1PRL,6)
// PWM1PRL<PWM1PRL7>
extern volatile __bit                   PWM1PRL7            __at(0x6CAF);	// @ (0xD95 * 8 + 7)
#define                                 PWM1PRL7_bit        _BIT_ACCESS(PWM1PRL,7)
// PWM1CLKCON<PWM1PS0>
extern volatile __bit                   PWM1PS0             __at(0x6CF4);	// @ (0xD9E * 8 + 4)
#define                                 PWM1PS0_bit         _BIT_ACCESS(PWM1CLKCON,4)
// PWM1CLKCON<PWM1PS1>
extern volatile __bit                   PWM1PS1             __at(0x6CF5);	// @ (0xD9E * 8 + 5)
#define                                 PWM1PS1_bit         _BIT_ACCESS(PWM1CLKCON,5)
// PWM1CLKCON<PWM1PS2>
extern volatile __bit                   PWM1PS2             __at(0x6CF6);	// @ (0xD9E * 8 + 6)
#define                                 PWM1PS2_bit         _BIT_ACCESS(PWM1CLKCON,6)
// PWM1TMRH<PWM1TMRH0>
extern volatile __bit                   PWM1TMRH0           __at(0x6CD0);	// @ (0xD9A * 8 + 0)
#define                                 PWM1TMRH0_bit       _BIT_ACCESS(PWM1TMRH,0)
// PWM1TMRH<PWM1TMRH1>
extern volatile __bit                   PWM1TMRH1           __at(0x6CD1);	// @ (0xD9A * 8 + 1)
#define                                 PWM1TMRH1_bit       _BIT_ACCESS(PWM1TMRH,1)
// PWM1TMRH<PWM1TMRH2>
extern volatile __bit                   PWM1TMRH2           __at(0x6CD2);	// @ (0xD9A * 8 + 2)
#define                                 PWM1TMRH2_bit       _BIT_ACCESS(PWM1TMRH,2)
// PWM1TMRH<PWM1TMRH3>
extern volatile __bit                   PWM1TMRH3           __at(0x6CD3);	// @ (0xD9A * 8 + 3)
#define                                 PWM1TMRH3_bit       _BIT_ACCESS(PWM1TMRH,3)
// PWM1TMRH<PWM1TMRH4>
extern volatile __bit                   PWM1TMRH4           __at(0x6CD4);	// @ (0xD9A * 8 + 4)
#define                                 PWM1TMRH4_bit       _BIT_ACCESS(PWM1TMRH,4)
// PWM1TMRH<PWM1TMRH5>
extern volatile __bit                   PWM1TMRH5           __at(0x6CD5);	// @ (0xD9A * 8 + 5)
#define                                 PWM1TMRH5_bit       _BIT_ACCESS(PWM1TMRH,5)
// PWM1TMRH<PWM1TMRH6>
extern volatile __bit                   PWM1TMRH6           __at(0x6CD6);	// @ (0xD9A * 8 + 6)
#define                                 PWM1TMRH6_bit       _BIT_ACCESS(PWM1TMRH,6)
// PWM1TMRH<PWM1TMRH7>
extern volatile __bit                   PWM1TMRH7           __at(0x6CD7);	// @ (0xD9A * 8 + 7)
#define                                 PWM1TMRH7_bit       _BIT_ACCESS(PWM1TMRH,7)
// PWM1TMRL<PWM1TMRL0>
extern volatile __bit                   PWM1TMRL0           __at(0x6CC8);	// @ (0xD99 * 8 + 0)
#define                                 PWM1TMRL0_bit       _BIT_ACCESS(PWM1TMRL,0)
// PWM1TMRL<PWM1TMRL1>
extern volatile __bit                   PWM1TMRL1           __at(0x6CC9);	// @ (0xD99 * 8 + 1)
#define                                 PWM1TMRL1_bit       _BIT_ACCESS(PWM1TMRL,1)
// PWM1TMRL<PWM1TMRL2>
extern volatile __bit                   PWM1TMRL2           __at(0x6CCA);	// @ (0xD99 * 8 + 2)
#define                                 PWM1TMRL2_bit       _BIT_ACCESS(PWM1TMRL,2)
// PWM1TMRL<PWM1TMRL3>
extern volatile __bit                   PWM1TMRL3           __at(0x6CCB);	// @ (0xD99 * 8 + 3)
#define                                 PWM1TMRL3_bit       _BIT_ACCESS(PWM1TMRL,3)
// PWM1TMRL<PWM1TMRL4>
extern volatile __bit                   PWM1TMRL4           __at(0x6CCC);	// @ (0xD99 * 8 + 4)
#define                                 PWM1TMRL4_bit       _BIT_ACCESS(PWM1TMRL,4)
// PWM1TMRL<PWM1TMRL5>
extern volatile __bit                   PWM1TMRL5           __at(0x6CCD);	// @ (0xD99 * 8 + 5)
#define                                 PWM1TMRL5_bit       _BIT_ACCESS(PWM1TMRL,5)
// PWM1TMRL<PWM1TMRL6>
extern volatile __bit                   PWM1TMRL6           __at(0x6CCE);	// @ (0xD99 * 8 + 6)
#define                                 PWM1TMRL6_bit       _BIT_ACCESS(PWM1TMRL,6)
// PWM1TMRL<PWM1TMRL7>
extern volatile __bit                   PWM1TMRL7           __at(0x6CCF);	// @ (0xD99 * 8 + 7)
#define                                 PWM1TMRL7_bit       _BIT_ACCESS(PWM1TMRL,7)
// PWM2CLKCON<PWM2CS0>
extern volatile __bit                   PWM2CS0             __at(0x6D70);	// @ (0xDAE * 8 + 0)
#define                                 PWM2CS0_bit         _BIT_ACCESS(PWM2CLKCON,0)
// PWM2CLKCON<PWM2CS1>
extern volatile __bit                   PWM2CS1             __at(0x6D71);	// @ (0xDAE * 8 + 1)
#define                                 PWM2CS1_bit         _BIT_ACCESS(PWM2CLKCON,1)
// PWM2DCH<PWM2DCH0>
extern volatile __bit                   PWM2DCH0            __at(0x6D20);	// @ (0xDA4 * 8 + 0)
#define                                 PWM2DCH0_bit        _BIT_ACCESS(PWM2DCH,0)
// PWM2DCH<PWM2DCH1>
extern volatile __bit                   PWM2DCH1            __at(0x6D21);	// @ (0xDA4 * 8 + 1)
#define                                 PWM2DCH1_bit        _BIT_ACCESS(PWM2DCH,1)
// PWM2DCH<PWM2DCH2>
extern volatile __bit                   PWM2DCH2            __at(0x6D22);	// @ (0xDA4 * 8 + 2)
#define                                 PWM2DCH2_bit        _BIT_ACCESS(PWM2DCH,2)
// PWM2DCH<PWM2DCH3>
extern volatile __bit                   PWM2DCH3            __at(0x6D23);	// @ (0xDA4 * 8 + 3)
#define                                 PWM2DCH3_bit        _BIT_ACCESS(PWM2DCH,3)
// PWM2DCH<PWM2DCH4>
extern volatile __bit                   PWM2DCH4            __at(0x6D24);	// @ (0xDA4 * 8 + 4)
#define                                 PWM2DCH4_bit        _BIT_ACCESS(PWM2DCH,4)
// PWM2DCH<PWM2DCH5>
extern volatile __bit                   PWM2DCH5            __at(0x6D25);	// @ (0xDA4 * 8 + 5)
#define                                 PWM2DCH5_bit        _BIT_ACCESS(PWM2DCH,5)
// PWM2DCH<PWM2DCH6>
extern volatile __bit                   PWM2DCH6            __at(0x6D26);	// @ (0xDA4 * 8 + 6)
#define                                 PWM2DCH6_bit        _BIT_ACCESS(PWM2DCH,6)
// PWM2DCH<PWM2DCH7>
extern volatile __bit                   PWM2DCH7            __at(0x6D27);	// @ (0xDA4 * 8 + 7)
#define                                 PWM2DCH7_bit        _BIT_ACCESS(PWM2DCH,7)
// PWM2INTE<PWM2DCIE>
extern volatile __bit                   PWM2DCIE            __at(0x6D61);	// @ (0xDAC * 8 + 1)
#define                                 PWM2DCIE_bit        _BIT_ACCESS(PWM2INTE,1)
// PWM2INTF<PWM2DCIF>
extern volatile __bit                   PWM2DCIF            __at(0x6D69);	// @ (0xDAD * 8 + 1)
#define                                 PWM2DCIF_bit        _BIT_ACCESS(PWM2INTF,1)
// PWM2DCL<PWM2DCL0>
extern volatile __bit                   PWM2DCL0            __at(0x6D18);	// @ (0xDA3 * 8 + 0)
#define                                 PWM2DCL0_bit        _BIT_ACCESS(PWM2DCL,0)
// PWM2DCL<PWM2DCL1>
extern volatile __bit                   PWM2DCL1            __at(0x6D19);	// @ (0xDA3 * 8 + 1)
#define                                 PWM2DCL1_bit        _BIT_ACCESS(PWM2DCL,1)
// PWM2DCL<PWM2DCL2>
extern volatile __bit                   PWM2DCL2            __at(0x6D1A);	// @ (0xDA3 * 8 + 2)
#define                                 PWM2DCL2_bit        _BIT_ACCESS(PWM2DCL,2)
// PWM2DCL<PWM2DCL3>
extern volatile __bit                   PWM2DCL3            __at(0x6D1B);	// @ (0xDA3 * 8 + 3)
#define                                 PWM2DCL3_bit        _BIT_ACCESS(PWM2DCL,3)
// PWM2DCL<PWM2DCL4>
extern volatile __bit                   PWM2DCL4            __at(0x6D1C);	// @ (0xDA3 * 8 + 4)
#define                                 PWM2DCL4_bit        _BIT_ACCESS(PWM2DCL,4)
// PWM2DCL<PWM2DCL5>
extern volatile __bit                   PWM2DCL5            __at(0x6D1D);	// @ (0xDA3 * 8 + 5)
#define                                 PWM2DCL5_bit        _BIT_ACCESS(PWM2DCL,5)
// PWM2DCL<PWM2DCL6>
extern volatile __bit                   PWM2DCL6            __at(0x6D1E);	// @ (0xDA3 * 8 + 6)
#define                                 PWM2DCL6_bit        _BIT_ACCESS(PWM2DCL,6)
// PWM2DCL<PWM2DCL7>
extern volatile __bit                   PWM2DCL7            __at(0x6D1F);	// @ (0xDA3 * 8 + 7)
#define                                 PWM2DCL7_bit        _BIT_ACCESS(PWM2DCL,7)
// PWM2CON<PWM2EN>
extern volatile __bit                   PWM2EN              __at(0x6D5F);	// @ (0xDAB * 8 + 7)
#define                                 PWM2EN_bit          _BIT_ACCESS(PWM2CON,7)
// PWMEN<PWM2EN_A>
extern volatile __bit                   PWM2EN_A            __at(0x6C71);	// @ (0xD8E * 8 + 1)
#define                                 PWM2EN_A_bit        _BIT_ACCESS(PWMEN,1)
// PIE3<PWM2IE>
extern volatile __bit                   PWM2IE              __at(0x49D);	// @ (0x93 * 8 + 5)
#define                                 PWM2IE_bit          _BIT_ACCESS(PIE3,5)
// PIR3<PWM2IF>
extern volatile __bit                   PWM2IF              __at(0x9D);	// @ (0x13 * 8 + 5)
#define                                 PWM2IF_bit          _BIT_ACCESS(PIR3,5)
// PWM2LDCON<PWM2LD>
extern volatile __bit                   PWM2LD              __at(0x6D7F);	// @ (0xDAF * 8 + 7)
#define                                 PWM2LD_bit          _BIT_ACCESS(PWM2LDCON,7)
// PWMLD<PWM2LDA_A>
extern volatile __bit                   PWM2LDA_A           __at(0x6C79);	// @ (0xD8F * 8 + 1)
#define                                 PWM2LDA_A_bit       _BIT_ACCESS(PWMLD,1)
// PWM2LDCON<PWM2LDM>
extern volatile __bit                   PWM2LDM             __at(0x6D7E);	// @ (0xDAF * 8 + 6)
#define                                 PWM2LDM_bit         _BIT_ACCESS(PWM2LDCON,6)
// PWM2LDCON<PWM2LDS0>
extern volatile __bit                   PWM2LDS0            __at(0x6D78);	// @ (0xDAF * 8 + 0)
#define                                 PWM2LDS0_bit        _BIT_ACCESS(PWM2LDCON,0)
// PWM2LDCON<PWM2LDS1>
extern volatile __bit                   PWM2LDS1            __at(0x6D79);	// @ (0xDAF * 8 + 1)
#define                                 PWM2LDS1_bit        _BIT_ACCESS(PWM2LDCON,1)
// PWM2CON<PWM2MODE0>
extern volatile __bit                   PWM2MODE0           __at(0x6D5A);	// @ (0xDAB * 8 + 2)
#define                                 PWM2MODE0_bit       _BIT_ACCESS(PWM2CON,2)
// PWM2CON<PWM2MODE1>
extern volatile __bit                   PWM2MODE1           __at(0x6D5B);	// @ (0xDAB * 8 + 3)
#define                                 PWM2MODE1_bit       _BIT_ACCESS(PWM2CON,3)
// PWM2CON<PWM2OE>
extern volatile __bit                   PWM2OE              __at(0x6D5E);	// @ (0xDAB * 8 + 6)
#define                                 PWM2OE_bit          _BIT_ACCESS(PWM2CON,6)
// PWM2OFH<PWM2OFH0>
extern volatile __bit                   PWM2OFH0            __at(0x6D40);	// @ (0xDA8 * 8 + 0)
#define                                 PWM2OFH0_bit        _BIT_ACCESS(PWM2OFH,0)
// PWM2OFH<PWM2OFH1>
extern volatile __bit                   PWM2OFH1            __at(0x6D41);	// @ (0xDA8 * 8 + 1)
#define                                 PWM2OFH1_bit        _BIT_ACCESS(PWM2OFH,1)
// PWM2OFH<PWM2OFH2>
extern volatile __bit                   PWM2OFH2            __at(0x6D42);	// @ (0xDA8 * 8 + 2)
#define                                 PWM2OFH2_bit        _BIT_ACCESS(PWM2OFH,2)
// PWM2OFH<PWM2OFH3>
extern volatile __bit                   PWM2OFH3            __at(0x6D43);	// @ (0xDA8 * 8 + 3)
#define                                 PWM2OFH3_bit        _BIT_ACCESS(PWM2OFH,3)
// PWM2OFH<PWM2OFH4>
extern volatile __bit                   PWM2OFH4            __at(0x6D44);	// @ (0xDA8 * 8 + 4)
#define                                 PWM2OFH4_bit        _BIT_ACCESS(PWM2OFH,4)
// PWM2OFH<PWM2OFH5>
extern volatile __bit                   PWM2OFH5            __at(0x6D45);	// @ (0xDA8 * 8 + 5)
#define                                 PWM2OFH5_bit        _BIT_ACCESS(PWM2OFH,5)
// PWM2OFH<PWM2OFH6>
extern volatile __bit                   PWM2OFH6            __at(0x6D46);	// @ (0xDA8 * 8 + 6)
#define                                 PWM2OFH6_bit        _BIT_ACCESS(PWM2OFH,6)
// PWM2OFH<PWM2OFH7>
extern volatile __bit                   PWM2OFH7            __at(0x6D47);	// @ (0xDA8 * 8 + 7)
#define                                 PWM2OFH7_bit        _BIT_ACCESS(PWM2OFH,7)
// PWM2INTE<PWM2OFIE>
extern volatile __bit                   PWM2OFIE            __at(0x6D63);	// @ (0xDAC * 8 + 3)
#define                                 PWM2OFIE_bit        _BIT_ACCESS(PWM2INTE,3)
// PWM2INTF<PWM2OFIF>
extern volatile __bit                   PWM2OFIF            __at(0x6D6B);	// @ (0xDAD * 8 + 3)
#define                                 PWM2OFIF_bit        _BIT_ACCESS(PWM2INTF,3)
// PWM2OFL<PWM2OFL0>
extern volatile __bit                   PWM2OFL0            __at(0x6D38);	// @ (0xDA7 * 8 + 0)
#define                                 PWM2OFL0_bit        _BIT_ACCESS(PWM2OFL,0)
// PWM2OFL<PWM2OFL1>
extern volatile __bit                   PWM2OFL1            __at(0x6D39);	// @ (0xDA7 * 8 + 1)
#define                                 PWM2OFL1_bit        _BIT_ACCESS(PWM2OFL,1)
// PWM2OFL<PWM2OFL2>
extern volatile __bit                   PWM2OFL2            __at(0x6D3A);	// @ (0xDA7 * 8 + 2)
#define                                 PWM2OFL2_bit        _BIT_ACCESS(PWM2OFL,2)
// PWM2OFL<PWM2OFL3>
extern volatile __bit                   PWM2OFL3            __at(0x6D3B);	// @ (0xDA7 * 8 + 3)
#define                                 PWM2OFL3_bit        _BIT_ACCESS(PWM2OFL,3)
// PWM2OFL<PWM2OFL4>
extern volatile __bit                   PWM2OFL4            __at(0x6D3C);	// @ (0xDA7 * 8 + 4)
#define                                 PWM2OFL4_bit        _BIT_ACCESS(PWM2OFL,4)
// PWM2OFL<PWM2OFL5>
extern volatile __bit                   PWM2OFL5            __at(0x6D3D);	// @ (0xDA7 * 8 + 5)
#define                                 PWM2OFL5_bit        _BIT_ACCESS(PWM2OFL,5)
// PWM2OFL<PWM2OFL6>
extern volatile __bit                   PWM2OFL6            __at(0x6D3E);	// @ (0xDA7 * 8 + 6)
#define                                 PWM2OFL6_bit        _BIT_ACCESS(PWM2OFL,6)
// PWM2OFL<PWM2OFL7>
extern volatile __bit                   PWM2OFL7            __at(0x6D3F);	// @ (0xDA7 * 8 + 7)
#define                                 PWM2OFL7_bit        _BIT_ACCESS(PWM2OFL,7)
// PWM2OFCON<PWM2OFM0>
extern volatile __bit                   PWM2OFM0            __at(0x6D85);	// @ (0xDB0 * 8 + 5)
#define                                 PWM2OFM0_bit        _BIT_ACCESS(PWM2OFCON,5)
// PWM2OFCON<PWM2OFM1>
extern volatile __bit                   PWM2OFM1            __at(0x6D86);	// @ (0xDB0 * 8 + 6)
#define                                 PWM2OFM1_bit        _BIT_ACCESS(PWM2OFCON,6)
// PWM2OFCON<PWM2OFMC>
extern volatile __bit                   PWM2OFMC            __at(0x6D84);	// @ (0xDB0 * 8 + 4)
#define                                 PWM2OFMC_bit        _BIT_ACCESS(PWM2OFCON,4)
// PWM2OFCON<PWM2OFS0>
extern volatile __bit                   PWM2OFS0            __at(0x6D80);	// @ (0xDB0 * 8 + 0)
#define                                 PWM2OFS0_bit        _BIT_ACCESS(PWM2OFCON,0)
// PWM2OFCON<PWM2OFS1>
extern volatile __bit                   PWM2OFS1            __at(0x6D81);	// @ (0xDB0 * 8 + 1)
#define                                 PWM2OFS1_bit        _BIT_ACCESS(PWM2OFCON,1)
// PWM2CON<PWM2OUT>
extern volatile __bit                   PWM2OUT             __at(0x6D5D);	// @ (0xDAB * 8 + 5)
#define                                 PWM2OUT_bit         _BIT_ACCESS(PWM2CON,5)
// PWMOUT<PWM2OUT_A>
extern volatile __bit                   PWM2OUT_A           __at(0x6C81);	// @ (0xD90 * 8 + 1)
#define                                 PWM2OUT_A_bit       _BIT_ACCESS(PWMOUT,1)
// PWM2PHH<PWM2PHH0>
extern volatile __bit                   PWM2PHH0            __at(0x6D10);	// @ (0xDA2 * 8 + 0)
#define                                 PWM2PHH0_bit        _BIT_ACCESS(PWM2PHH,0)
// PWM2PHH<PWM2PHH1>
extern volatile __bit                   PWM2PHH1            __at(0x6D11);	// @ (0xDA2 * 8 + 1)
#define                                 PWM2PHH1_bit        _BIT_ACCESS(PWM2PHH,1)
// PWM2PHH<PWM2PHH2>
extern volatile __bit                   PWM2PHH2            __at(0x6D12);	// @ (0xDA2 * 8 + 2)
#define                                 PWM2PHH2_bit        _BIT_ACCESS(PWM2PHH,2)
// PWM2PHH<PWM2PHH3>
extern volatile __bit                   PWM2PHH3            __at(0x6D13);	// @ (0xDA2 * 8 + 3)
#define                                 PWM2PHH3_bit        _BIT_ACCESS(PWM2PHH,3)
// PWM2PHH<PWM2PHH4>
extern volatile __bit                   PWM2PHH4            __at(0x6D14);	// @ (0xDA2 * 8 + 4)
#define                                 PWM2PHH4_bit        _BIT_ACCESS(PWM2PHH,4)
// PWM2PHH<PWM2PHH5>
extern volatile __bit                   PWM2PHH5            __at(0x6D15);	// @ (0xDA2 * 8 + 5)
#define                                 PWM2PHH5_bit        _BIT_ACCESS(PWM2PHH,5)
// PWM2PHH<PWM2PHH6>
extern volatile __bit                   PWM2PHH6            __at(0x6D16);	// @ (0xDA2 * 8 + 6)
#define                                 PWM2PHH6_bit        _BIT_ACCESS(PWM2PHH,6)
// PWM2PHH<PWM2PHH7>
extern volatile __bit                   PWM2PHH7            __at(0x6D17);	// @ (0xDA2 * 8 + 7)
#define                                 PWM2PHH7_bit        _BIT_ACCESS(PWM2PHH,7)
// PWM2INTE<PWM2PHIE>
extern volatile __bit                   PWM2PHIE            __at(0x6D62);	// @ (0xDAC * 8 + 2)
#define                                 PWM2PHIE_bit        _BIT_ACCESS(PWM2INTE,2)
// PWM2INTF<PWM2PHIF>
extern volatile __bit                   PWM2PHIF            __at(0x6D6A);	// @ (0xDAD * 8 + 2)
#define                                 PWM2PHIF_bit        _BIT_ACCESS(PWM2INTF,2)
// PWM2PHL<PWM2PHL0>
extern volatile __bit                   PWM2PHL0            __at(0x6D08);	// @ (0xDA1 * 8 + 0)
#define                                 PWM2PHL0_bit        _BIT_ACCESS(PWM2PHL,0)
// PWM2PHL<PWM2PHL1>
extern volatile __bit                   PWM2PHL1            __at(0x6D09);	// @ (0xDA1 * 8 + 1)
#define                                 PWM2PHL1_bit        _BIT_ACCESS(PWM2PHL,1)
// PWM2PHL<PWM2PHL2>
extern volatile __bit                   PWM2PHL2            __at(0x6D0A);	// @ (0xDA1 * 8 + 2)
#define                                 PWM2PHL2_bit        _BIT_ACCESS(PWM2PHL,2)
// PWM2PHL<PWM2PHL3>
extern volatile __bit                   PWM2PHL3            __at(0x6D0B);	// @ (0xDA1 * 8 + 3)
#define                                 PWM2PHL3_bit        _BIT_ACCESS(PWM2PHL,3)
// PWM2PHL<PWM2PHL4>
extern volatile __bit                   PWM2PHL4            __at(0x6D0C);	// @ (0xDA1 * 8 + 4)
#define                                 PWM2PHL4_bit        _BIT_ACCESS(PWM2PHL,4)
// PWM2PHL<PWM2PHL5>
extern volatile __bit                   PWM2PHL5            __at(0x6D0D);	// @ (0xDA1 * 8 + 5)
#define                                 PWM2PHL5_bit        _BIT_ACCESS(PWM2PHL,5)
// PWM2PHL<PWM2PHL6>
extern volatile __bit                   PWM2PHL6            __at(0x6D0E);	// @ (0xDA1 * 8 + 6)
#define                                 PWM2PHL6_bit        _BIT_ACCESS(PWM2PHL,6)
// PWM2PHL<PWM2PHL7>
extern volatile __bit                   PWM2PHL7            __at(0x6D0F);	// @ (0xDA1 * 8 + 7)
#define                                 PWM2PHL7_bit        _BIT_ACCESS(PWM2PHL,7)
// PWM2CON<PWM2POL>
extern volatile __bit                   PWM2POL             __at(0x6D5C);	// @ (0xDAB * 8 + 4)
#define                                 PWM2POL_bit         _BIT_ACCESS(PWM2CON,4)
// PWM2PRH<PWM2PRH0>
extern volatile __bit                   PWM2PRH0            __at(0x6D30);	// @ (0xDA6 * 8 + 0)
#define                                 PWM2PRH0_bit        _BIT_ACCESS(PWM2PRH,0)
// PWM2PRH<PWM2PRH1>
extern volatile __bit                   PWM2PRH1            __at(0x6D31);	// @ (0xDA6 * 8 + 1)
#define                                 PWM2PRH1_bit        _BIT_ACCESS(PWM2PRH,1)
// PWM2PRH<PWM2PRH2>
extern volatile __bit                   PWM2PRH2            __at(0x6D32);	// @ (0xDA6 * 8 + 2)
#define                                 PWM2PRH2_bit        _BIT_ACCESS(PWM2PRH,2)
// PWM2PRH<PWM2PRH3>
